Repository: Exmeaning/ClickZen
Catalog: src/ClickZen.App/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# Nav_Devices
source: Devices
zh_cn: 设备

# Nav_Mirror
source: Mirror
zh_cn: 投屏

# Nav_Recording
source: Recording
zh_cn: 录制

# Nav_Automation
source: Automation
zh_cn: 自动化

# Nav_Variables
source: Variables
zh_cn: 变量

# Nav_Logs
source: Logs
zh_cn: 日志

# Nav_Settings
source: Settings
zh_cn: 设置

# Status_EngineIdle
source: Automation: idle
zh_cn: 自动化：空闲

# Status_RecordingIdle
source: Recording: idle
zh_cn: 录制：空闲

# Status_RecordingActive
source: Recording: in progress
zh_cn: 录制：进行中

# Status_RecordingPlaying
source: Recording: playing item {0} (loop {1})
zh_cn: 录制：回放第 {0} 项（第 {1} 轮）

# Status_SyncOff
source: Sync service: off
zh_cn: 同步服务：未启用

# Page_Devices_Title.Text
source: Devices
zh_cn: 设备

# Page_Devices_Description.Text
source: Manage USB devices, wireless devices and emulator windows.
zh_cn: 管理 USB、无线设备和模拟器窗口。

# Page_Mirror_Title.Text
source: Mirror
zh_cn: 投屏

# Page_Mirror_Description.Text
source: View and control the current device in real time.
zh_cn: 实时显示并控制当前设备的画面。

# Page_Recording_Title.Text
source: Recording
zh_cn: 录制

# Page_Recording_Description.Text
source: Record touch gestures, edit them and play them back with the original timing.
zh_cn: 录制触控操作，编辑后按原节奏回放。

# Page_Automation_Title.Text
source: Automation
zh_cn: 自动化

# Page_Automation_Description.Text
source: Image-recognition and variable driven automation schemes.
zh_cn: 基于图像识别和变量的自动化方案。

# Page_Variables_Title.Text
source: Variables
zh_cn: 变量

# Page_Variables_Description.Text
source: Inspect runtime variables and configure the network sync service.
zh_cn: 查看运行时变量，配置网络同步服务。

# Page_Logs_Title.Text
source: Logs
zh_cn: 日志

# Page_Logs_Description.Text
source: Runtime log and ADB terminal.
zh_cn: 运行日志与 ADB 终端。

# Page_Settings_Title.Text
source: Settings
zh_cn: 设置

# Page_Settings_Description.Text
source: Appearance, devices, automation and other preferences.
zh_cn: 外观、设备、自动化与其他偏好。

# Error_Title
source: Something went wrong
zh_cn: 出现错误

# Error_CrashSaved
source: ClickZen hit an unhandled error. A report was saved to: {0}
zh_cn: 程序遇到未处理的错误。错误报告已保存到： {0}

# Error_OpenFolder
source: Open folder
zh_cn: 打开所在文件夹

# Common_Close
source: Close
zh_cn: 关闭

# Common_Ok
source: OK
zh_cn: 确定

# Common_Cancel
source: Cancel
zh_cn: 取消

# Error_MissingTools
source: Bundled components are missing: {0}. Please re-download the full ClickZen package.
zh_cn: 缺少随附的组件：{0}。请重新下载完整的 ClickZen。

# TitleBar_DeviceSwitcher.PlaceholderText
source: No device
zh_cn: 未连接设备

# TitleBar_NoDevice
source: No device
zh_cn: 未连接设备

# SessionState_Streaming
source: Mirroring
zh_cn: 投屏中

# SessionState_Connected
source: Connected (no video)
zh_cn: 已连接（无画面）

# SessionState_Connecting
source: Connecting
zh_cn: 正在连接

# SessionState_Reconnecting
source: Reconnecting
zh_cn: 正在重连

# SessionState_Faulted
source: Connection failed
zh_cn: 连接失败

# SessionState_Disconnected
source: Not mirroring
zh_cn: 未投屏

# Devices_AdbStartFailed
source: ADB server could not be started
zh_cn: ADB 服务无法启动

# Devices_AddWireless.Label
source: Add wireless device
zh_cn: 添加无线设备

# Devices_Refresh.Label
source: Refresh
zh_cn: 刷新

# Devices_ConnectedHeader.Text
source: Connected devices
zh_cn: 已连接的设备

# Devices_EmptyTitle.Text
source: No devices detected
zh_cn: 没有检测到设备

# Devices_EmptyHint.Text
source: Connect a phone over USB with USB debugging enabled, or add a wireless device / scan for local emulators using the buttons above.
zh_cn: 用 USB 连接手机并开启“USB 调试”（小米等机型还需开启“USB 调试（安全设置）”），或在右上角添加无线设备、扫描本地模拟器。

# Devices_CurrentBadge.Text
source: Current
zh_cn: 当前设备

# Devices_StartMirror.Content
source: Start mirroring
zh_cn: 开始投屏

# Devices_StopMirror.Content
source: Stop mirroring
zh_cn: 停止投屏

# Devices_SetCurrent.Content
source: Set as current
zh_cn: 设为当前

# Devices_DisconnectWireless.Content
source: Disconnect
zh_cn: 断开

# Devices_SavedHeader.Text
source: Saved wireless devices
zh_cn: 已保存的无线设备

# Devices_SavedEmpty.Text
source: Give a wireless device a name when connecting to save it for one-click or automatic reconnection.
zh_cn: 连接无线设备时填写名称即可保存，之后可一键连接或开机自动连接。

# Devices_AutoConnect.Content
source: Auto connect
zh_cn: 自动连接

# Devices_Connect.Content
source: Connect
zh_cn: 连接

# Devices_RemoveSaved.ToolTipService.ToolTip
source: Remove
zh_cn: 删除

# Devices_Connected
source: Connected to {0}
zh_cn: 已连接 {0}

# Devices_Disconnected
source: Disconnected {0}
zh_cn: 已断开 {0}

# Devices_Paired
source: Paired. Now enter the IP address and port shown on the phone's Wireless debugging screen to connect.
zh_cn: 配对成功。请在下方输入手机“无线调试”页面上显示的 IP 地址和端口完成连接。

# Devices_ScanNone
source: No local emulators found. Make sure the emulator is running with ADB enabled.
zh_cn: 没有发现本地模拟器。请确认模拟器已启动并开启了 ADB 调试。

# Devices_ScanFound
source: Found and connected {0} emulator(s).
zh_cn: 发现 {0} 个模拟器，已连接。

# DeviceKind_Wireless
source: Wireless
zh_cn: 无线

# DeviceKind_Emulator
source: Emulator
zh_cn: 模拟器

# DeviceState_Unauthorized
source: Unauthorized: allow USB debugging on the phone
zh_cn: 未授权：请在手机上允许 USB 调试

# DeviceState_Offline
source: Offline
zh_cn: 离线

# DeviceState_Other
source: Unavailable
zh_cn: 不可用

# DeviceState_Ready
source: Ready
zh_cn: 已就绪

# AdbError_Unauthorized
source: The device is not authorized. Allow USB debugging in the prompt on the phone.
zh_cn: 设备未授权。请在手机弹出的对话框中允许 USB 调试。

# AdbError_Offline
source: The device is offline. Reconnect the cable or toggle USB debugging.
zh_cn: 设备离线。请重新插拔数据线或重启 USB 调试。

# AdbError_DeviceNotFound
source: Device not found; it may have been disconnected.
zh_cn: 找不到设备，它可能已断开。

# AdbError_Timeout
source: The operation timed out.
zh_cn: 操作超时。

# AdbError_ServerStartFailed
source: The ADB server could not be started.
zh_cn: ADB 服务无法启动。

# AdbError_ConnectionRefused
source: Connection refused. Check that wireless debugging is on and the address is correct.
zh_cn: 连接被拒绝。请确认设备已开启无线调试且地址正确。

# AddWireless_Dialog.Title
source: Add wireless device
zh_cn: 添加无线设备

# AddWireless_TabDirect.Text
source: Connect by IP
zh_cn: IP 直连

# AddWireless_TabPair.Text
source: Pair with code
zh_cn: 配对码配对

# AddWireless_TabScan.Text
source: Scan emulators
zh_cn: 扫描模拟器

# AddWireless_DirectHint.Text
source: For devices with TCP debugging enabled (adb tcpip) or emulators on the network. Port defaults to 5555.
zh_cn: 适用于已开启 TCP 调试（adb tcpip）的设备或局域网内的模拟器。不填端口时默认 5555。

# AddWireless_Address.Header
source: Address
zh_cn: 地址

# AddWireless_SaveAs.Header
source: Save as (optional)
zh_cn: 保存为（可选）

# AddWireless_SaveAs.PlaceholderText
source: e.g. Bedroom tablet
zh_cn: 例如：卧室的平板

# AddWireless_ConnectButton.Content
source: Connect
zh_cn: 连接

# AddWireless_PairHint.Text
source: Android 11+: on the phone open Developer options → Wireless debugging → Pair device with pairing code.
zh_cn: Android 11 及以上：在手机“开发者选项 → 无线调试 → 使用配对码配对设备”中查看配对地址和配对码。

# AddWireless_PairAddress.Header
source: Pairing address
zh_cn: 配对地址

# AddWireless_PairCode.Header
source: Pairing code
zh_cn: 配对码

# AddWireless_PairButton.Content
source: Pair
zh_cn: 配对

# AddWireless_PairThenConnect.Text
source: After pairing, connect using the address and port shown at the top of the Wireless debugging screen (different from the pairing port).
zh_cn: 配对后，使用“无线调试”页面顶部显示的地址和端口连接（与配对端口不同）。

# AddWireless_ConnectAddress.Header
source: Connect address
zh_cn: 连接地址

# AddWireless_ScanHint.Text
source: Tries the local ADB ports used by common emulators (MuMu, LDPlayer, Nox, MEmu, BlueStacks…).
zh_cn: 依次尝试常见模拟器的本地 ADB 端口（MuMu、雷电、夜神、逍遥、蓝叠等）。

# AddWireless_ScanButton.Content
source: Scan
zh_cn: 开始扫描

# AddWireless_PresetsHeader.Text
source: Common emulator ports
zh_cn: 常见模拟器端口

# AddWireless_AddressRequired
source: Enter an address.
zh_cn: 请输入地址。

# AddWireless_PairFieldsRequired
source: Enter the pairing address and code.
zh_cn: 请输入配对地址和配对码。

# AddWireless_ConnectPortRequired
source: Enter the connect address including the port.
zh_cn: 请输入包含端口的连接地址。

# Logs_Level.Header
source: Level
zh_cn: 级别

# Logs_LevelDebug.Content
source: Debug and above
zh_cn: 调试及以上

# Logs_LevelInfo.Content
source: Info and above
zh_cn: 信息及以上

# Logs_LevelWarning.Content
source: Warnings and above
zh_cn: 警告及以上

# Logs_LevelError.Content
source: Errors only
zh_cn: 仅错误

# Logs_Search.PlaceholderText
source: Search log
zh_cn: 搜索日志

# Logs_Search.Header
source: Search
zh_cn: 搜索

# Logs_Pause.ToolTipService.ToolTip
source: Pause
zh_cn: 暂停滚动

# Logs_Clear.ToolTipService.ToolTip
source: Clear log
zh_cn: 清空日志

# Logs_OpenFolder.ToolTipService.ToolTip
source: Open log folder
zh_cn: 打开日志文件夹

# Logs_TerminalHeader.Text
source: ADB terminal (current device)
zh_cn: ADB 终端（当前设备）

# Logs_QuickCommands.Content
source: Quick commands
zh_cn: 常用命令

# Logs_CommandBox.PlaceholderText
source: Type a shell command, Enter to run, Up/Down for history
zh_cn: 输入 shell 命令，回车执行，上下键切换历史

# Logs_AsRoot.Content
source: Run as su
zh_cn: 以 su 执行

# Logs_Run.Content
source: Run
zh_cn: 执行

# Logs_Cancel.Content
source: Stop
zh_cn: 停止

# Logs_ClearTerminal.ToolTipService.ToolTip
source: Clear terminal
zh_cn: 清空终端

# Logs_NoDevice
source: No current device. Connect one on the Devices page first.
zh_cn: 没有当前设备。请先在“设备”页连接设备。

# Logs_Cancelled
source: (stopped)
zh_cn: （已停止）

# Mirror_Back.ToolTipService.ToolTip
source: Back (or right-click the screen)
zh_cn: 返回（或在画面上点右键）

# Mirror_Home.ToolTipService.ToolTip
source: Home (or middle-click the screen)
zh_cn: 主页（或在画面上点中键）

# Mirror_Recents.ToolTipService.ToolTip
source: Recent apps
zh_cn: 最近任务

# Mirror_VolumeUp.ToolTipService.ToolTip
source: Volume up
zh_cn: 音量加

# Mirror_VolumeDown.ToolTipService.ToolTip
source: Volume down
zh_cn: 音量减

# Mirror_Power.ToolTipService.ToolTip
source: Power
zh_cn: 电源键

# Mirror_Rotate.ToolTipService.ToolTip
source: Rotate screen
zh_cn: 旋转屏幕

# Mirror_ScreenOff.ToolTipService.ToolTip
source: Turn device screen off (keep mirroring)
zh_cn: 关闭手机屏幕（继续投屏）

# Mirror_Pick.ToolTipService.ToolTip
source: Pick: click the screen to copy device coordinates
zh_cn: 取点：点击画面复制设备坐标

# Mirror_Screenshot.ToolTipService.ToolTip
source: Screenshot
zh_cn: 截图

# Mirror_ScreenshotSave.Text
source: Save to file
zh_cn: 保存到文件

# Mirror_ScreenshotCopy.Text
source: Copy to clipboard
zh_cn: 复制到剪贴板

# Mirror_PasteText.ToolTipService.ToolTip
source: Paste the PC clipboard into the device
zh_cn: 把电脑剪贴板粘贴到手机

# Mirror_PopOut.ToolTipService.ToolTip
source: Open in a separate window
zh_cn: 在独立窗口中打开

# Mirror_NoDevice
source: No current device. Connect one on the Devices page.
zh_cn: 没有当前设备。请在“设备”页连接设备。

# Mirror_NotStarted
source: The current device is not mirroring. Click "Start mirroring" on the Devices page.
zh_cn: 当前设备未在投屏。请在“设备”页点击“开始投屏”。

# Mirror_WaitingForVideo
source: Waiting for video…
zh_cn: 等待画面…

# Mirror_Reconnecting
source: Reconnecting: {0}
zh_cn: 正在重新连接：{0}

# Mirror_Failed
source: Mirroring failed: {0}
zh_cn: 投屏失败：{0}

# Mirror_Info
source: {0} · device {1}×{2} · video {3}×{4} · {5} fps
zh_cn: {0} · 设备 {1}×{2} · 画面 {3}×{4} · {5} fps

# Mirror_PickHint
source: Pick mode: click the screen to copy device coordinates. Click the pick button again to exit.
zh_cn: 取点模式：在画面上点击以复制设备坐标。再次点击取点按钮退出。

# Mirror_PointCopied
source: Copied coordinates {0}
zh_cn: 已复制坐标 {0}

# Mirror_ScreenOffHint
source: The device screen is off; mirroring and control keep working.
zh_cn: 手机屏幕已关闭，投屏和控制仍然有效。

# Mirror_ClipboardEmpty
source: The clipboard has no text.
zh_cn: 剪贴板中没有文本。

# Mirror_NoFrame
source: No picture yet.
zh_cn: 还没有画面。

# Mirror_ScreenshotSaved
source: Screenshot saved: {0}
zh_cn: 截图已保存：{0}

# Mirror_ScreenshotCopied
source: Screenshot copied to the clipboard.
zh_cn: 截图已复制到剪贴板。

# Rec_StartRecording
source: Start recording
zh_cn: 开始录制

# Rec_StopRecording
source: Stop recording
zh_cn: 停止录制

# Rec_RecordOnDevice.ToolTipService.ToolTip
source: Record on device: operate on the device screen directly
zh_cn: 在手机上录制：直接在设备屏幕上操作

# Rec_RecordOnDeviceHint
source: Recording touches made on the device. Click "Stop recording" when done.
zh_cn: 正在录制设备上的触控。完成后点击“停止录制”。

# Rec_RecordingOnDevice
source: Recording on device
zh_cn: 设备端录制中

# Rec_DeviceCaptureUnavailable
source: On-device recording is not available for this device.
zh_cn: 当前设备不支持设备端录制。

# Rec_DeviceInfo
source: {0} · device {1}×{2}
zh_cn: {0} · 设备 {1}×{2}

# Rec_Untitled
source: Untitled recording
zh_cn: 未命名录制

# Rec_DocSummary
source: {0} gestures · length {1} · screen {2}
zh_cn: {0} 个手势 · 时长 {1} · 屏幕 {2}

# Rec_New.Label
source: New
zh_cn: 新建

# Rec_New.ToolTipService.ToolTip
source: New recording
zh_cn: 新建录制

# Rec_Open.Label
source: Open
zh_cn: 打开

# Rec_Open.ToolTipService.ToolTip
source: Open a .czrec recording
zh_cn: 打开 .czrec 录制文件

# Rec_Save.Label
source: Save
zh_cn: 保存

# Rec_Save.ToolTipService.ToolTip
source: Save (Ctrl+S)
zh_cn: 保存（Ctrl+S）

# Rec_SaveAs.Label
source: Save as
zh_cn: 另存为

# Rec_SaveAs.ToolTipService.ToolTip
source: Save as…
zh_cn: 另存为…

# Rec_FileType
source: ClickZen recording
zh_cn: ClickZen 录制

# Rec_Saved
source: Recording saved: {0}
zh_cn: 录制已保存：{0}

# Rec_SaveFailed
source: Save failed: {0}
zh_cn: 保存失败：{0}

# Rec_Opened
source: Opened {0}
zh_cn: 已打开 {0}

# Rec_OpenFailed
source: Could not open the recording: {0}
zh_cn: 无法打开录制文件：{0}

# Rec_UnsavedTitle
source: Save changes?
zh_cn: 保存更改？

# Rec_UnsavedMessage
source: "{0}" has unsaved changes.
zh_cn: “{0}”有未保存的更改。

# Rec_SaveChanges
source: Save
zh_cn: 保存

# Rec_DontSave
source: Don't save
zh_cn: 不保存

# Rec_EmptyTimeline.Text
source: No gestures yet. Click "Start recording" above the picture, then operate on the mirrored screen.
zh_cn: 还没有手势。点击画面上方的“开始录制”，然后在投屏画面上操作。

# Rec_Kind_Tap
source: Tap
zh_cn: 点击

# Rec_Kind_LongPress
source: Long press
zh_cn: 长按

# Rec_Kind_Swipe
source: Swipe
zh_cn: 滑动

# Rec_Kind_MultiTouch
source: Multi-touch
zh_cn: 多指

# Rec_Kind_Key
source: Key
zh_cn: 按键

# Rec_Kind_Text
source: Text
zh_cn: 文本

# Rec_Fingers
source: {0} fingers
zh_cn: {0} 指

# Rec_Key_Back
source: Back
zh_cn: 返回

# Rec_Key_Home
source: Home
zh_cn: 主页

# Rec_Key_Recents
source: Recent apps
zh_cn: 最近任务

# Rec_Key_VolumeUp
source: Volume up
zh_cn: 音量加

# Rec_Key_VolumeDown
source: Volume down
zh_cn: 音量减

# Rec_Key_Power
source: Power
zh_cn: 电源键

# Rec_Key_Code
source: Key code {0}
zh_cn: 键码 {0}

# Rec_EditHeader.Text
source: Edit
zh_cn: 编辑

# Rec_NoSelection
source: Nothing selected
zh_cn: 未选择

# Rec_SelectionCount
source: {0} selected
zh_cn: 已选择 {0} 项

# Rec_StartTime.Header
source: Start time (ms)
zh_cn: 开始时间（毫秒）

# Rec_SetStart.Content
source: Set
zh_cn: 设置

# Rec_TimeDelta.Header
source: Time offset (ms, may be negative)
zh_cn: 时间偏移（毫秒，可为负）

# Rec_ShiftTime.Content
source: Shift
zh_cn: 平移

# Rec_Ripple.Content
source: Also move every later gesture
zh_cn: 同时移动之后的所有手势

# Rec_PickPoint.ToolTipService.ToolTip
source: Pick a point on the picture
zh_cn: 在画面上取点

# Rec_PickHint
source: Click the mirrored screen to set the coordinates.
zh_cn: 在投屏画面上点击以设置坐标。

# Rec_MoveTo.Content
source: Move to
zh_cn: 移到

# Rec_Dx.Header
source: X offset
zh_cn: X 偏移

# Rec_Dy.Header
source: Y offset
zh_cn: Y 偏移

# Rec_Translate.Content
source: Offset
zh_cn: 偏移

# Rec_Delete.Text
source: Delete
zh_cn: 删除

# Rec_PlaybackHeader.Text
source: Playback
zh_cn: 回放

# Rec_Speed.Header
source: Speed
zh_cn: 速度

# Rec_Loops.Header
source: Loops (0 = forever)
zh_cn: 循环次数（0 = 无限）

# Rec_Randomize.Header
source: Randomize
zh_cn: 随机化

# Rec_Randomize.OnContent
source: On
zh_cn: 开

# Rec_Randomize.OffContent
source: Off
zh_cn: 关

# Rec_Play.Text
source: Play
zh_cn: 回放

# Rec_PlayFromSelection.Text
source: Play from selection
zh_cn: 从选择处回放

# Rec_Stop.Text
source: Stop
zh_cn: 停止

# Rec_PlaybackStarting
source: Starting playback…
zh_cn: 正在开始回放…

# Rec_PlaybackProgress
source: Playing {0} / {1} · {2}
zh_cn: 正在回放 {0} / {1} · {2}

# Rec_LoopOf
source: loop {0} of {1}
zh_cn: 第 {0} / {1} 轮

# Rec_LoopInfinite
source: loop {0} (forever)
zh_cn: 第 {0} 轮（无限）

# Rec_PlaybackDone
source: Playback finished.
zh_cn: 回放完成。

# Rec_PlaybackStopped
source: Playback stopped.
zh_cn: 回放已停止。

# Rec_PlaybackFailed
source: Playback failed: {0}
zh_cn: 回放失败：{0}

# Rec_Busy
source: Recording or playback is in progress.
zh_cn: 正在录制或回放。

# Rec_Empty
source: The recording has no gestures.
zh_cn: 录制中没有手势。

# Rec_OrientationWarning
source: The recording was made in another orientation; coordinates are scaled and may be inaccurate.
zh_cn: 录制时的屏幕方向与当前不同，坐标会按比例缩放，结果可能不准确。

# Status_EngineRunning
source: Automation: running ({0}, {1} device(s))
zh_cn: 自动化：运行中（{0}，{1} 台设备）

# Auto_New.Label
source: New
zh_cn: 新建

# Auto_New.ToolTipService.ToolTip
source: New scheme
zh_cn: 新建方案

# Auto_Open.Label
source: Open
zh_cn: 打开

# Auto_Open.ToolTipService.ToolTip
source: Open a .czscheme scheme (Ctrl+O)
zh_cn: 打开 .czscheme 方案（Ctrl+O）

# Auto_Save.Label
source: Save
zh_cn: 保存

# Auto_Save.ToolTipService.ToolTip
source: Save (Ctrl+S)
zh_cn: 保存（Ctrl+S）

# Auto_SaveAs.Label
source: Save as
zh_cn: 另存为

# Auto_SaveAs.ToolTipService.ToolTip
source: Save to a new scheme file
zh_cn: 另存为新的方案文件

# Auto_ImportTasks.Label
source: Import tasks
zh_cn: 导入任务

# Auto_ImportTasks.ToolTipService.ToolTip
source: Add the tasks (and their templates) of another scheme file to this scheme
zh_cn: 把另一个方案文件中的任务（及其模板）加入当前方案

# Auto_ExportTask.Label
source: Export task
zh_cn: 导出任务

# Auto_ExportTask.ToolTipService.ToolTip
source: Export the selected task and the templates it uses as a separate scheme file
zh_cn: 把选中的任务及其引用的模板导出为单独的方案文件

# Auto_FileType
source: ClickZen scheme
zh_cn: ClickZen 方案

# Auto_Untitled
source: Untitled scheme
zh_cn: 未命名方案

# Auto_NotSaved
source: Not saved to a file
zh_cn: 未保存到文件

# Auto_DocSummary
source: {0} task(s) · {1} template(s) · reference size {2} · {3}
zh_cn: {0} 个任务 · {1} 个模板 · 参考分辨率 {2} · {3}

# Auto_SchemeName.Header
source: Scheme name
zh_cn: 方案名称

# Auto_SchemeName.PlaceholderText
source: Untitled scheme
zh_cn: 未命名方案

# Auto_UnsavedTitle
source: Save changes?
zh_cn: 保存更改？

# Auto_UnsavedMessage
source: Scheme "{0}" has unsaved changes.
zh_cn: 方案“{0}”有未保存的更改。

# Auto_SaveChanges
source: Save
zh_cn: 保存

# Auto_DontSave
source: Don't save
zh_cn: 不保存

# Auto_Opened
source: Opened {0}
zh_cn: 已打开 {0}

# Auto_OpenFailed
source: Could not open the scheme: {0}
zh_cn: 无法打开方案：{0}

# Auto_Saved
source: Saved to {0}
zh_cn: 已保存到 {0}

# Auto_SaveFailed
source: Saving failed: {0}
zh_cn: 保存失败：{0}

# Auto_Imported
source: Imported {0} task(s) and {1} template(s).
zh_cn: 已导入 {0} 个任务、{1} 个模板。

# Auto_ImportRescaled
source: The reference sizes differ; coordinates and templates were rescaled.
zh_cn: 参考分辨率不同，坐标和模板已按比例换算。

# Auto_ImportFailed
source: Import failed: {0}
zh_cn: 导入失败：{0}

# Auto_ImportOrientation
source: That scheme was made for the other screen orientation and cannot be imported.
zh_cn: 该方案的屏幕方向与当前方案不同，无法导入。

# Auto_Exported
source: Task "{0}" was exported to {1}
zh_cn: 已把任务“{0}”导出到 {1}

# Auto_StopFirst
source: Stop the running scheme first.
zh_cn: 请先停止正在运行的方案。

# Auto_TasksHeader.Text
source: Tasks
zh_cn: 任务

# Auto_AddTask.ToolTipService.ToolTip
source: New task
zh_cn: 新建任务

# Auto_DuplicateTask.ToolTipService.ToolTip
source: Duplicate task
zh_cn: 复制任务

# Auto_DeleteTask.ToolTipService.ToolTip
source: Delete task (Delete)
zh_cn: 删除任务（Delete）

# Auto_TaskEnabled.ToolTipService.ToolTip
source: Enable this task
zh_cn: 启用此任务

# Auto_NoTasks.Text
source: No tasks yet. Click + to create one, then add rules in the editor in the middle.
zh_cn: 还没有任务。点击 + 新建一个任务，再在中间的编辑器里添加规则。

# Auto_NoTaskSelected.Text
source: Select a task on the left to edit it.
zh_cn: 在左侧选择一个任务进行编辑。

# Auto_NewTaskName
source: New task
zh_cn: 新任务

# Auto_UnnamedTask
source: (unnamed task)
zh_cn: （未命名任务）

# Auto_CopyOf
source: {0} copy
zh_cn: {0} 副本

# Auto_TaskSummary
source: {0} rule(s) · cooldown {1} s
zh_cn: {0} 条规则 · 冷却 {1} 秒

# Auto_DeleteTaskTitle
source: Delete task?
zh_cn: 删除任务？

# Auto_DeleteTaskMessage
source: Task "{0}" and all its rules will be deleted.
zh_cn: 任务“{0}”及其所有规则将被删除。

# Auto_Delete
source: Delete
zh_cn: 删除

# Auto_TemplatesHeader.Text
source: Templates
zh_cn: 模板

# Auto_CaptureTemplate.ToolTipService.ToolTip
source: Drag a rectangle on the picture to capture a template
zh_cn: 在画面上框选并截取模板

# Auto_RenameTemplate.ToolTipService.ToolTip
source: Rename template (or double-click)
zh_cn: 重命名模板（或双击）

# Auto_DeleteTemplate.ToolTipService.ToolTip
source: Delete template
zh_cn: 删除模板

# Auto_NoTemplates.Text
source: No templates yet. Click the capture button and drag a rectangle on the picture.
zh_cn: 还没有模板。点击截取按钮，在右侧画面上框选一块区域。

# Auto_TemplateUnused
source: Unused
zh_cn: 未使用

# Auto_TemplateUsedBy
source: Used by {0} task(s)
zh_cn: 被 {0} 个任务使用

# Auto_TemplateDefaultName
source: Template
zh_cn: 模板

# Auto_NameTemplateTitle
source: Template name
zh_cn: 模板名称

# Auto_RenameTemplateTitle
source: Rename template
zh_cn: 重命名模板

# Auto_TemplateCaptured
source: Captured template "{0}" ({1}×{2})
zh_cn: 已截取模板“{0}”（{1}×{2}）

# Auto_TemplateTooSmall
source: The selection is too small (at least 4×4 pixels).
zh_cn: 选区太小，至少需要 4×4 像素。

# Auto_TemplateFailed
source: Could not capture the template: {0}
zh_cn: 无法截取模板：{0}

# Auto_DeleteTemplateTitle
source: Delete template?
zh_cn: 删除模板？

# Auto_DeleteTemplateMessage
source: Template "{0}" will be deleted.
zh_cn: 模板“{0}”将被删除。

# Auto_DeleteTemplateInUse
source: Template "{0}" is used by {1} task(s) ({2}). After deleting it those image conditions have no template and always count as "not found". Delete anyway?
zh_cn: 模板“{0}”正被 {1} 个任务使用（{2}）。删除后这些图像条件将找不到模板，始终视为“未找到”。仍要删除吗？

# Auto_OrientationAuthoring
source: The scheme's reference size is {0} but the device is now {1} (other orientation). Rotate the device to the scheme's orientation before picking.
zh_cn: 方案的参考分辨率是 {0}，而设备当前为 {1}（方向不同）。请把设备旋转到与方案一致的方向后再取点。

# Auto_OrientationMismatch
source: The device is in another orientation than the scheme; test results may be wrong.
zh_cn: 设备方向与方案不同，测试结果可能不准确。

# Auto_OrientationRunWarning
source: The device orientation differs from the scheme's reference size; coordinates will be stretched.
zh_cn: 设备方向与方案的参考分辨率不同，坐标将被拉伸。

# Auto_ClearTest.ToolTipService.ToolTip
source: Clear test result
zh_cn: 清除测试结果

# Auto_TestNoPicture
source: No picture. Start mirroring the current device first.
zh_cn: 没有画面。请先让当前设备开始投屏。

# Auto_TestTemplateMissing
source: The condition's template does not exist.
zh_cn: 条件引用的模板不存在。

# Auto_TestAreaOutside
source: The search area is outside the picture.
zh_cn: 搜索区域在画面之外。

# Auto_TestFound
source: Found, score {0} (threshold {1})
zh_cn: 找到，置信度 {0}（阈值 {1}）

# Auto_TestNotFound
source: Not found, best score {0} (threshold {1})
zh_cn: 未找到，最高置信度 {0}（阈值 {1}）

# Auto_TestColor
source: Actual {0}, expected {1}, difference {2} (tolerance {3})
zh_cn: 实际颜色 {0}，期望 {1}，差值 {2}（容差 {3}）

# Auto_TestBadColor
source: Colour "{0}" is invalid; use #RRGGBB.
zh_cn: 颜色“{0}”无效，应为 #RRGGBB。

# Auto_TestPointOutside
source: The point is outside the picture.
zh_cn: 该点在画面之外。

# Auto_TestConditionTrue
source: Condition holds
zh_cn: 条件成立

# Auto_TestConditionFalse
source: Condition does not hold
zh_cn: 条件不成立

# Auto_TestUnsupported
source: Only image and colour conditions can be tested on the picture.
zh_cn: 只有图像和颜色条件可以在画面上测试。

# Auto_Run
source: Run
zh_cn: 运行

# Auto_Stop
source: Stop
zh_cn: 停止

# Auto_Step.Text
source: Step
zh_cn: 单步

# Auto_IntervalLabel.Text
source: Interval (ms)
zh_cn: 检测间隔 (ms)

# Auto_LogToggle.Text
source: Run log
zh_cn: 运行日志

# Auto_ClearLog.ToolTipService.ToolTip
source: Clear the run log
zh_cn: 清空运行日志

# Auto_TargetCurrent
source: Current device
zh_cn: 当前设备

# Auto_TargetCount
source: {0} devices
zh_cn: {0} 台设备

# Auto_TargetNotMirroring
source: {0} (not mirroring)
zh_cn: {0}（未投屏）

# Auto_NoTarget
source: No device to run on. Connect a device and start mirroring first.
zh_cn: 没有可运行的设备。请先连接设备并开始投屏。

# Auto_DeviceNotMirroring
source: The device is not mirroring, so there is no picture.
zh_cn: 设备未在投屏，无法取得画面。

# Auto_NothingToRun
source: The scheme has no tasks.
zh_cn: 方案中没有任务。

# Auto_Ready
source: Ready
zh_cn: 就绪
